# Clean Data

In [1]:
import pandas as pd
import numpy as np
import json
import csv
import datetime

In [2]:
from faker import Faker
import random
import re

## Customer Info

Customer Profile

In [3]:
#Randomly Generate Customer Personal Info
fake = Faker()

num_cus = 10000

profiles = []
for i in range(num_cus):
    first_name = fake.first_name()
    last_name = fake.last_name()
    email = fake.email()
    profiles.append((first_name, last_name, email))
    
customer_df = pd.DataFrame(profiles).reset_index().rename(columns={'index':'customer_id',
                                                    0: 'first_name',
                                                    1: 'last_name',
                                                    2: 'email'})

#Randomly Generate royalty points with a specific distribution
weights = [0.6, 0.2, 0.15, 0.05]
royalty_points = np.random.choice([np.random.randint(1, 501),
                                   np.random.randint(501, 3001),
                                   np.random.randint(3001, 10001),
                                   np.random.randint(10001, 100000)],
                                   size=num_cus, p=weights)
customer_df['royalty_points'] = royalty_points

#Add royalty level base on royalty points. 

#royalty 分数
#1-500 Silver
#500-3000 Gold
#3000-10000 Platium
#10000+ Diamond

conditions = [
    (customer_df['royalty_points'] >= 1) & (customer_df['royalty_points'] <= 500),
    (customer_df['royalty_points'] > 500) & (customer_df['royalty_points'] <= 3000),
    (customer_df['royalty_points'] > 3000) & (customer_df['royalty_points'] <= 10000),
    (customer_df['royalty_points'] > 10000)
]
values = ['Silver', 'Gold', 'Platinum', 'Diamond']

customer_df['royalty_level'] = np.select(conditions, values)

In [4]:
customer_df.to_csv('customer_profiles.csv', index=False)

In [5]:
customer_df

,customer_id,first_name,last_name,email,royalty_points,royalty_level
0,0,Michelle,Riley,lindsay65@example.net,2887,Gold
1,1,Catherine,Zimmerman,kayla33@example.net,2887,Gold
2,2,Tammy,Clark,mark33@example.net,208,Silver
3,3,Eric,Carson,vwade@example.net,208,Silver
4,4,Debra,Morris,browncheryl@example.net,208,Silver
...,...,...,...,...,...,...
9995,9995,Andrew,Jones,jessicaschneider@example.net,208,Silver
9996,9996,Trevor,Sharp,pbarker@example.com,2887,Gold
9997,9997,Latasha,Ward,fsmith@example.com,2887,Gold
9998,9998,Nancy,Kidd,yhale@example.com,2887,Gold
9999,9999,Brandy,Quinn,fwagner@example.com,2887,Gold

In [6]:
customer_id_list = customer_df['customer_id'].tolist()

Membership_status Table

In [7]:
membership_status_df = pd.DataFrame({
    'royalty_level':['Silver', 'Gold', 'Platinum', 'Diamond'],
    'discount': [0.98,0.95,0.9,0.85]
})

In [8]:
membership_status_df

  royalty_level  discount
0        Silver      0.98
1          Gold      0.95
2      Platinum      0.90
3       Diamond      0.85

## Car Profiles

In [9]:
car_df_full = pd.read_csv('CarRentalData.csv')

car_df_full = car_df_full.rename(columns={
    'vehicle.make': 'car_brand',
    'vehicle.model': 'car_model',
    'vehicle.type': 'car_type',
    'fuelType': 'fuel_type',
    'vehicle.year': 'car_year',
    'owner.id': 'owner_id'
})

In [10]:
car_df = car_df_full[['car_brand',
                      'car_model',
                      'car_type',
                      'fuel_type',
                      'car_year',
                      'owner_id']]

#Randomly Generate color for cars
car_df['color'] = np.random.choice(['red', 'blue', 'green','grey','black','white','silver','yellow','champagne'], 
                          size=len(car_df))

#Randomly Generate plate numbers for cars
unique_plate_numbers = set()

# Generate plate numbers until the desired number of unique values is reached
while len(unique_plate_numbers) < len(car_df):
    plate_number = ''.join(np.random.choice(list('0123456789ABCDEFGHIJKLMNOPQRSTUVWXYZ'), size=5))
    unique_plate_numbers.add(plate_number)

plate_numbers = list(unique_plate_numbers)
car_df['plate_number'] = plate_numbers

C:\Users\mytyr\AppData\Local\Temp\ipykernel_26488\2417592764.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_df['color'] = np.random.choice(['red', 'blue', 'green','grey','black','white','silver','yellow','champagne'],
C:\Users\mytyr\AppData\Local\Temp\ipykernel_26488\2417592764.py:21: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  car_df['plate_number'] = plate_numbers

In [11]:
plate_list = car_df['plate_number'].tolist()

## Hotel Profiles

Hotels

In [12]:
with open("hotels.json",encoding='utf-8') as file:
    hotels_data = json.load(file)

In [13]:
hotels = []
for item in hotels_data['root']['page']:
    hotel = {}
    if 'hotel_id' in item['record']:
        hotel['hotel_id'] = item['record']['hotel_id']
        hotel['hotel_name'] = item['record']['hotel_name']
    hotels.append(hotel)

In [14]:
hotels_df = pd.DataFrame(hotels)
hotels_df = hotels_df.drop_duplicates(subset='hotel_id').reset_index(drop=True)
hotels_df.dropna(subset=['hotel_id'], inplace=True)

In [15]:
hotels_df

      hotel_id                                hotel_name
0      4521185                   OYO 23501 Log Inn Plaza
1      5323150      SPOT ON 40211 Hotel Prakash Inn SPOT
2      1662781                  OYO Flagship 205 Bandhan
3      4048734                 Paradise Rooms in Gangtok
4      5617914                       Dream house. G-72/2
...        ...                                       ...
15443  4031776  OYO Flagship 15698 Citiotel Shivajinagar
15444  4625077                  OYO 19008 Hotel Doon 999
15445  5556801                      Hexa Royal Residency
15446  5311720             Illas Domain Orange Apartment
15447  5756425                      Hotel Rosewood plaza

[15447 rows x 2 columns]

In [16]:
hotels_id_list = hotels_df['hotel_id'].tolist()

Hotel Rooms

In [17]:
rooms = []
for item in hotels_data['root']['page']:
    if 'hotel_id' in item['record']:
        hotel_id = item['record']['hotel_id']
        for room_type in item['record']['room_type']:
            room = {}
            room['hotel_id'] = hotel_id
            room['room_type_name'] = room_type['room_type_name']
            room['room_type_price'] = room_type['room_type_price']
            room['room_type_occupancy'] = room_type['room_type_occupancy']
            room['room_type_breakfast'] = room_type['room_type_breakfast']
            room['room_type_cancellation'] = room_type['room_type_cancellation']
            rooms.append(room)

room_types_df = pd.DataFrame(rooms)

In [18]:
def random_room_number():
    room_number = str(random.randint(1, 5)) + str(random.randint(0, 9)) + str(random.randint(0, 3)) + str(random.randint(1, 9))
    return room_number

In [19]:
def duplicate_rooms(group):
    num_duplicates = random.randint(5, 30)
    room_numbers = [random_room_number() for i in range(num_duplicates)]
    new_df = group.sample(n=num_duplicates, replace=True)
    new_df['room_number'] = room_numbers
    return new_df

In [20]:
hotel_rooms_df = room_types_df.groupby(['hotel_id', 'room_type_name']).apply(duplicate_rooms).reset_index(drop=True)

In [21]:
hotel_rooms_df['room_type_price'].replace('N/A', None, inplace=True)
hotel_rooms_df.drop_duplicates(subset=['hotel_id', 'room_number'], inplace=True)

hotel_rooms_df['room_type_price'] = hotel_rooms_df['room_type_price'].apply(lambda x: round(x / 6.5, 2) if x is not None else np.nan)

In [22]:
hotel_rooms_df

,hotel_id,room_type_name,room_type_price,room_type_occupancy,room_type_breakfast,room_type_cancellation,room_number
0,1002081,Deluxe Double Room,NaN,3,Room Only,Non-refundable,3934
1,1002081,Deluxe Double Room,NaN,3,Room Only,Non-refundable,3006
2,1002081,Deluxe Double Room,NaN,3,Room Only,Non-refundable,4006
3,1002081,Deluxe Double Room,NaN,3,Room Only,Non-refundable,2713
4,1002081,Deluxe Double Room,NaN,3,Room Only,Non-refundable,5205
...,...,...,...,...,...,...,...
559663,909966,Superior Double or Twin Room,448.0,2,half_board,free_cancellation,4628
559664,909966,Superior Double or Twin Room,448.0,2,half_board,free_cancellation,2307
559665,909966,Superior Double or Twin Room,448.0,2,half_board,free_cancellation,3107
559666,909966,Superior Double or Twin Room,448.0,2,half_board,free_cancellation,5531
559667,909966,Superior Double or Twin Room,448.0,2,half_board,free_cancellation,3616

## Flights Profiles

Airlines

In [23]:
airlines_df = pd.read_csv('airlines.csv',usecols=['airline_id','name','alias','IATA','ICAO'])

airlines_df = airlines_df.rename(columns={'airline_id': 'id'})

In [24]:
airlines_df

,id,name,alias,IATA,ICAO
0,1,Private flight,\N,-,NaN
1,2,135 Airways,\N,NaN,GNL
2,3,1Time Airline,\N,1T,RNX
3,4,2 Sqn No 1 Elementary Flying Training School,\N,NaN,WYT
4,5,213 Flight Unit,\N,NaN,TFU
...,...,...,...,...,...
6156,21248,GX Airlines,NaN,NaN,CBG
6157,21251,Lynx Aviation (L3/SSX),NaN,NaN,SSX
6158,21268,Jetgo Australia,NaN,JG,\N
6159,21270,Air Carnival,NaN,2S,\N
6160,21317,Svyaz Rossiya,Russian Commuter,7R,SJM

Airports

In [25]:
airports_df = pd.read_csv('airports_info.csv',usecols=['airport_id','name','IATA','ICAO', 'country','timezone'])

airports_df= airports_df.replace(r'\N', None)

In [26]:
airports_df

,airport_id,name,country,IATA,ICAO,timezone
0,1,Goroka Airport,Papua New Guinea,GKA,AYGA,10
1,2,Madang Airport,Papua New Guinea,MAG,AYMD,10
2,3,Mount Hagen Kagamuga Airport,Papua New Guinea,HGU,AYMH,10
3,4,Nadzab Airport,Papua New Guinea,LAE,AYNZ,10
4,5,Port Moresby Jacksons International Airport,Papua New Guinea,POM,AYPY,10
...,...,...,...,...,...,...
7693,14106,Rogachyovo Air Base,Russia,None,ULDA,None
7694,14107,Ulan-Ude East Airport,Russia,None,XIUW,None
7695,14108,Krechevitsy Air Base,Russia,None,ULLK,None
7696,14109,Desierto de Atacama Airport,Chile,CPO,SCAT,None
7697,14110,Melitopol Air Base,Ukraine,None,UKDM,None

Airplanes

In [27]:
airplane_df = pd.read_csv('planes.csv')
airplane_df = airplane_df.reset_index().rename(columns={'index': 'airplane_id','name':'airplane_name'})
airplane_df= airplane_df.replace(r'\N', None)

In [28]:
airplane_df

     airplane_id                                 airplane_name  IATA  ICAO
0              0                       Aerospatiale (Nord) 262   ND2  N262
1              1  Aerospatiale (Sud Aviation) Se.210 Caravelle   CRV  S210
2              2                  Aerospatiale SN.601 Corvette   NDC  S601
3              3                Aerospatiale/Alenia ATR 42-300   AT4  AT43
4              4                Aerospatiale/Alenia ATR 42-500   AT5  AT45
..           ...                                           ...   ...   ...
241          241                                Tupolev Tu-144  None  T144
242          242                                Tupolev Tu-154   TU5  T154
243          243                                Tupolev Tu-204   T20  T204
244          244                               Yakovlev Yak-40   YK4  YK40
245          245                               Yakovlev Yak-42   YK2  YK42

[246 rows x 4 columns]

Flight Routes

In [29]:
flight_routes_df = pd.read_csv('flight_routes.csv',usecols=['Airline ID','Source airport ID',
                                                              'Destination airport ID', 'Stops','Equipment'])

In [30]:
flight_routes_df = flight_routes_df.rename(columns={'Airline ID': 'airline_id',
                                                       'Source airport ID': 'origin',
                                                       'Destination airport ID': 'destination',
                                                       'Stops': 'stop',
                                                       'Equipment': 'airplane'})
flight_routes_df = flight_routes_df.reindex(columns=['origin', 'destination', 'stop','airline_id', 'airplane'])
flight_routes_df = flight_routes_df.reset_index().rename(columns={'index': 'flight_route_id'})

flight_routes_df= flight_routes_df.replace(r'\N', None)

In [31]:
flight_routes_df = flight_routes_df[~flight_routes_df['airplane'].str.contains(' ',na=False)]

In [32]:
flight_routes_df = pd.merge(flight_routes_df, airplane_df[['IATA', 'airplane_id']], 
                     how='left', left_on='airplane', right_on='IATA')
flight_routes_df = flight_routes_df.drop(columns=['airplane','IATA'])
flight_routes_df['airplane_id'] = flight_routes_df['airplane_id'].fillna(-1).astype(int)

flight_routes_df['origin'] = flight_routes_df['origin'].fillna(-1).astype(int)
flight_routes_df['destination'] = flight_routes_df['destination'].fillna(-1).astype(int)

flight_routes_df= flight_routes_df.replace(-1, None)

In [33]:
#Check to see if we have records of the origin and destination airports in the airport table 
mask = flight_routes_df['origin'].isin(airports_df['airport_id'])
flight_routes_df = flight_routes_df[mask]

mask = flight_routes_df['destination'].isin(airports_df['airport_id'])
flight_routes_df = flight_routes_df[mask]

In [34]:
flight_routes_df = flight_routes_df.drop_duplicates(subset='flight_route_id').reset_index(drop=True)

In [35]:
flight_routes_df

       flight_route_id origin destination  stop airline_id airplane_id
0                    0   2965        2990     0        410         120
1                    1   2966        2990     0        410         120
2                    2   2966        2962     0        410         120
3                    3   2968        2990     0        410         120
4                    4   2968        4078     0        410         120
...                ...    ...         ...   ...        ...         ...
49697            67658   6334        3341     0       4178         230
49698            67659   4029        2912     0      19016          70
49699            67660   2912        4029     0      19016          70
49700            67661   2912        2913     0      19016          70
49701            67662   2913        2912     0      19016          70

[49702 rows x 6 columns]

In [36]:
flight_route_id_list = flight_routes_df['flight_route_id'].tolist()

Flight Info

In [37]:
num_flights = 5000
flight_info_df = pd.DataFrame({
    'flight_route_id': np.random.choice(flight_route_id_list, size=num_flights)
})

# create a column with random departure date/time
start_dates = pd.to_datetime(np.random.randint(pd.Timestamp('2023-01-01').value//10**9//60, pd.Timestamp('2023-04-15').value//10**9//60, size=num_flights), unit='m')
start_times = pd.to_timedelta(np.random.randint(0, 1440, size=num_flights), unit='m')
flight_info_df['dep_time'] = start_dates + start_times
flight_lengths = pd.to_timedelta(np.random.randint(30, 900, size=num_flights), unit='m')

# create a column with arrival date/time by adding flight length to departure date/time
flight_info_df['arr_time'] = flight_info_df['dep_time'] + flight_lengths

delay_weight = [0.9,0.1]
flight_info_df['delayed'] = np.random.choice([0,1], size=num_flights,p=delay_weight)

flight_info_df['time_hour'] = (flight_lengths / pd.Timedelta(minutes=1)).astype(int)

flight_info_df = flight_info_df.reset_index().rename(columns={'index':'flight_info_id'})

In [38]:
flight_info_df

,flight_info_id,flight_route_id,dep_time,arr_time,delayed,time_hour
0,0,48483,2023-04-15 20:54:00,2023-04-16 09:56:00,0,782
1,1,30665,2023-01-20 01:53:00,2023-01-20 08:55:00,0,422
2,2,27686,2023-02-20 04:29:00,2023-02-20 18:16:00,0,827
3,3,683,2023-02-10 20:27:00,2023-02-10 22:13:00,0,106
4,4,24383,2023-02-27 14:05:00,2023-02-28 01:20:00,0,675
...,...,...,...,...,...,...
4995,4995,20827,2023-01-05 09:51:00,2023-01-05 12:41:00,0,170
4996,4996,26388,2023-02-05 02:33:00,2023-02-05 15:49:00,0,796
4997,4997,65490,2023-04-10 08:43:00,2023-04-10 11:50:00,0,187
4998,4998,3986,2023-02-28 07:20:00,2023-02-28 17:24:00,0,604
4999,4999,54065,2023-01-09 09:43:00,2023-01-09 17:39:00,0,476

In [39]:
flight_info_id_list = flight_info_df['flight_info_id'].tolist()

### Order Table

In [40]:
#Order table
total_order_num = 20000

customer_id = [random.choice(customer_id_list) for i in range(total_order_num)]

start_date = datetime.date(2023, 1, 1)
today = datetime.date.today()
order_date = [fake.date_between(start_date=start_date, end_date=today) for i in range(total_order_num)]

order_tracker_df = pd.DataFrame({'customer_id': customer_id,
                              'order_time': order_date
                                   })

order_ids = list(range(1, total_order_num+1))
order_tracker_df['order_id'] = order_ids

In [41]:
order_tracker_df

       customer_id  order_time  order_id
0             7240  2023-04-08         1
1             6080  2023-02-23         2
2             9599  2023-01-11         3
3             6723  2023-01-07         4
4             1438  2023-01-09         5
...            ...         ...       ...
19995         8342  2023-04-14     19996
19996         8495  2023-04-23     19997
19997         6116  2023-04-22     19998
19998          842  2023-02-17     19999
19999         7097  2023-02-05     20000

[20000 rows x 3 columns]

In [42]:
order_id_list = order_tracker_df['order_id'].tolist()

reservation_tracker Table

In [45]:
#Suppose 3500 reservations
num_res = int(total_order_num*1.25)

dup_order_id = [random.choice(order_id_list) for i in range(num_res-len(order_id_list))]
res_order_id = order_id_list + dup_order_id

reservation_type_weights = [0.35, 0.23, 0.42]

reservation_tracker_df = pd.DataFrame({
    'order_id':res_order_id,
    'reservation_type': np.random.choice(['flight', 'car', 'hotel'], size=num_res, p=reservation_type_weights)
})

reservation_tracker_df = reservation_tracker_df.reset_index().rename(columns={'index': 'reservation_id'})

In [46]:
reservation_tracker_df

       reservation_id  order_id reservation_type
0                   0         1           flight
1                   1         2           flight
2                   2         3            hotel
3                   3         4              car
4                   4         5            hotel
...               ...       ...              ...
24995           24995      5556            hotel
24996           24996     13830           flight
24997           24997     10954            hotel
24998           24998      7691           flight
24999           24999     11957              car

[25000 rows x 3 columns]

In [47]:
#Get the list of reservation id for car reservations
car_res_id_list = reservation_tracker_df.loc[reservation_tracker_df['reservation_type'] == 'car', 'reservation_id'].tolist()
car_res_num = len(car_res_id_list)

#Get the list of reservation id for hotel reservations
hotel_res_id_list = reservation_tracker_df.loc[reservation_tracker_df['reservation_type'] == 'hotel', 'reservation_id'].tolist()
hotel_res_num = len(hotel_res_id_list)

#Get the list of reservation id for flight reservations
flight_res_id_list = reservation_tracker_df.loc[reservation_tracker_df['reservation_type'] == 'flight', 'reservation_id'].tolist()
flight_res_num = len(flight_res_id_list)

### Car Reservations

In [48]:
#Randomly choose plate number
plate_number = [random.choice(plate_list) for i in range(car_res_num)]

#Randomly Generate Pickup and Dropoff Dates
start_date = datetime.date(2023, 1, 1)
end_date = datetime.date(2023, 12, 31)
pick_up_date = [fake.date_between(start_date=start_date, end_date=end_date) for i in range(car_res_num)]
drop_date = [pick_up_date[i] + datetime.timedelta(days=random.randint(1, 7)) for i in range(car_res_num)]

#Randomly Generate price
price = [round(random.uniform(50, 500), 2) for i in range(car_res_num)]

In [49]:
#car_reservation table without reservation id
car_reservation_df = pd.DataFrame({'reservation_id': car_res_id_list,
                                    'plate_number': plate_number,
                                    'pick_up_date': pick_up_date,
                                    'drop_date': drop_date,
                                    'price': price
                                   })

In [50]:
car_reservation_df

      reservation_id plate_number pick_up_date   drop_date   price
0                  3        B6RQS   2023-05-24  2023-05-29   88.63
1                  8        9JWGC   2023-07-03  2023-07-06  242.99
2                 22        QM2F0   2023-08-03  2023-08-09  104.91
3                 25        CF5TB   2023-07-23  2023-07-27   63.12
4                 38        227W8   2023-07-12  2023-07-19  149.14
...              ...          ...          ...         ...     ...
5668           24975        98A0E   2023-01-09  2023-01-13  171.06
5669           24979        S2KY6   2023-12-25  2023-12-31  332.76
5670           24982        VTF46   2023-12-29  2024-01-05  171.71
5671           24988        3R0D4   2023-05-23  2023-05-24   87.41
5672           24999        P4J5M   2023-12-05  2023-12-09  351.20

[5673 rows x 5 columns]

### Hotel Reservations

In [51]:
#Suppose some hotels have more than one reservation

#First filter the hotel_id assume only 1 res
hotel_id = np.random.choice(hotels_id_list, size = hotel_res_num)
filtered_df = hotel_rooms_df.loc[hotel_rooms_df['hotel_id'].isin(hotel_id)]
room_numbers = filtered_df.groupby('hotel_id')['room_number'].apply(lambda x: np.random.choice(x)).reset_index()

#Some rooms may be booked more than once
random_subset = room_numbers.sample(n=(hotel_res_num-len(room_numbers)), replace=True)
hotel_id_room = pd.concat([room_numbers, random_subset], ignore_index=True)
hotel_id_room['reservation_id'] = hotel_res_id_list

#randomly generate date
arrival_date = [fake.date_between(start_date=start_date, end_date=end_date) for i in range(hotel_res_num)]
departure_date = [arrival_date[i] + datetime.timedelta(days=random.randint(1, 7)) for i in range(hotel_res_num)]

#Create hotel reservation dataframe
hotel_reservation_df = pd.DataFrame({'reservation_id': hotel_res_id_list,
                                    'arrival_date': arrival_date,
                                    'departure_date': departure_date,
                                    'car_parking_needed': [random.choice([0,1]) for i in range(hotel_res_num)]
                                   })

#Add hotel_id and room_number info into the dataframe
hotel_reservation_df = pd.merge(hotel_reservation_df, hotel_id_room)

In [52]:
hotel_reservation_df

,reservation_id,arrival_date,departure_date,car_parking_needed,hotel_id,room_number
0,2,2023-05-06,2023-05-08,1,1002081,3613
1,4,2023-05-11,2023-05-17,1,1003345,2804
2,12,2023-08-09,2023-08-10,1,1005273,2734
3,13,2023-04-29,2023-05-01,0,1005275,4126
4,14,2023-02-28,2023-03-05,0,1006356,4434
...,...,...,...,...,...,...
10699,24989,2023-02-13,2023-02-18,0,4985280,3221
10700,24990,2023-06-25,2023-07-02,0,2954428,2634
10701,24993,2023-10-13,2023-10-16,0,405073,2515
10702,24995,2023-05-31,2023-06-06,0,5675084,5432
10703,24997,2023-08-22,2023-08-25,0,3203995,3631

In [53]:
##Calculate the price for each reseravation according to the number of nights stayed and room price

#Find number of nights stayed for each reservation
hotel_reservation_df['nights_stayed'] = (hotel_reservation_df['departure_date'] - hotel_reservation_df['arrival_date']).dt.days

comp_hotel_df = pd.merge(hotel_reservation_df, 
                         hotel_rooms_df[['hotel_id', 'room_number','room_type_price']], 
                         on=['hotel_id', 'room_number'])

comp_hotel_df['price'] = comp_hotel_df.apply(lambda row: row['nights_stayed'] * row['room_type_price'] 
                                             if not pd.isna(row['room_type_price']) else None, axis=1)

In [54]:
hotel_reservation_df = comp_hotel_df.drop(columns=['nights_stayed','room_type_price'])

In [55]:
hotel_reservation_df

,reservation_id,arrival_date,departure_date,car_parking_needed,hotel_id,room_number,price
0,2,2023-05-06,2023-05-08,1,1002081,3613,NaN
1,4,2023-05-11,2023-05-17,1,1003345,2804,1499.10
2,19127,2023-10-25,2023-10-30,1,1003345,2804,1249.25
3,12,2023-08-09,2023-08-10,1,1005273,2734,396.31
4,13,2023-04-29,2023-05-01,0,1005275,4126,1085.22
...,...,...,...,...,...,...,...
10699,20049,2023-12-03,2023-12-04,0,907086,2811,804.00
10700,18154,2023-01-21,2023-01-26,0,907095,5303,1621.55
10701,21512,2023-02-10,2023-02-13,1,907095,5303,972.93
10702,18156,2023-12-13,2023-12-19,0,908193,3623,3502.14
10703,18157,2023-08-23,2023-08-25,0,909966,3302,983.70

### Flight Reservations

In [56]:
def generate_seat_number(row):
    seat_class = row['class']
    if seat_class == 'First Class':
        return (''.join(np.random.choice(list('1'), size=1)) + ''.join(np.random.choice(list('0123456789'), size=1)) +''.join(np.random.choice(list('ABCDEF'), size=1)))
    if seat_class == 'Business Class':
        return (''.join(np.random.choice(list('1'), size=1)) + ''.join(np.random.choice(list('0123456789'), size=1)) +''.join(np.random.choice(list('ABCDEF'), size=1)))
    if seat_class == 'Premium Economy':
        return (''.join(np.random.choice(list('2345'), size=1)) + ''.join(np.random.choice(list('0123456789'), size=1)) +''.join(np.random.choice(list('ABCDEF'), size=1)))
    else:
        return (''.join(np.random.choice(list('3456'), size=1)) + ''.join(np.random.choice(list('0123456789'), size=1)) +''.join(np.random.choice(list('ABCDEF'), size=1)))

In [57]:
flight_class_weights = [0.8,0.15,0.04,0.01]

flight_reservation_df = pd.DataFrame({'reservation_id': flight_res_id_list,
                                    'flight_status': np.random.choice([0,1],size = flight_res_num),
                                    'class': np.random.choice(['Economy Class', 'Premium Economy', 'Business Class', 'First Class'],size = flight_res_num,p=flight_class_weights)   
                                   })

flight_reservation_df['seat'] = flight_reservation_df.apply(generate_seat_number, axis=1)

means = {'Economy Class': 500, 'Premium Economy': 1000, 'Business Class': 3000, 'First Class': 6000}
stds = {'Economy Class': 50, 'Premium Economy': 200, 'Business Class': 500, 'First Class': 1000}

# generate prices for each class
flight_reservation_df['price']  = flight_reservation_df['class'].apply(lambda x: np.random.normal(means[x], stds[x])).round(2)

In [58]:
flight_reservation_df['flight_info_id'] = np.random.choice(flight_info_id_list,size = flight_res_num)

In [59]:
flight_reservation_df

,reservation_id,flight_status,class,seat,price,flight_info_id
0,0,0,Economy Class,55E,472.03,2499
1,1,1,Premium Economy,23E,1349.90,2102
2,5,0,Premium Economy,42F,1044.05,1280
3,6,1,Economy Class,60A,439.53,309
4,7,0,Premium Economy,45E,1048.80,3182
...,...,...,...,...,...,...
8618,24991,0,Economy Class,61C,411.61,2397
8619,24992,0,Economy Class,41A,483.61,1633
8620,24994,1,Economy Class,68A,471.23,4134
8621,24996,1,Economy Class,47B,437.54,362
8622,24998,0,Economy Class,63D,461.32,4372

### Royalty Points Reward to the Order Tracker

In [60]:
all_res = pd.concat([car_reservation_df[['reservation_id', 'price']], 
                    hotel_reservation_df[['reservation_id', 'price']],
                    flight_reservation_df[['reservation_id', 'price']]], axis=0)

complete_res = pd.merge(reservation_tracker_df,all_res)

price_order = complete_res.groupby('order_id')['price'].sum().reset_index()
price_order['price'] = price_order['price'].astype(int)

order_tracker_df = pd.merge(order_tracker_df,price_order).rename(columns={'price': 'royalty_point_reward'})

In [61]:
order_tracker_df

       customer_id  order_time  order_id  royalty_point_reward
0             7240  2023-04-08         1                   472
1             6080  2023-02-23         2                  1349
2             9599  2023-01-11         3                     0
3             6723  2023-01-07         4                    88
4             1438  2023-01-09         5                  2321
...            ...         ...       ...                   ...
19995         8342  2023-04-14     19996                  1367
19996         8495  2023-04-23     19997                   210
19997         6116  2023-04-22     19998                   191
19998          842  2023-02-17     19999                   368
19999         7097  2023-02-05     20000                  1938

[20000 rows x 4 columns]

# Address Profile

In [62]:
# Randomly generate 100,000 address profiles
num_addresses = 100000
addresses = []
for i in range(num_addresses):
    street = fake.street_address()
    city = fake.city()
    state = fake.state()
    country = fake.country()
    zipcode = fake.zipcode()
    addresses.append((street, city, state, country, zipcode))

address_df = pd.DataFrame(addresses, columns=['street', 'city', 'state', 'country', 'zipcode'])
address_df = address_df.reset_index().rename(columns={'index': 'address_id'})

In [63]:
address_df.to_csv('address.csv', index=False)

In [64]:
address_id_list = address_df['address_id'].tolist()

In [65]:
hotel_add_num = len(hotels_df)
hotel_address_list = address_id_list[0:hotel_add_num]

airport_add_num = len(airports_df)
airports_address_list = address_id_list[hotel_add_num:(hotel_add_num+airport_add_num)]

customer_add_num = len(customer_df)
customer_address_list = address_id_list[(hotel_add_num+airport_add_num):(hotel_add_num+airport_add_num+customer_add_num)]

#car pickup and dropoff location, assume 1.5x num of reservations
car_add_num = int(1.5 * len(car_reservation_df))
car_address_list = address_id_list[(hotel_add_num+airport_add_num+customer_add_num):(hotel_add_num+airport_add_num+customer_add_num+ car_add_num)]

#### Assign Address Id to different tables

In [66]:
hotels_df['address_id'] = [random.choice(hotel_address_list) for i in range(len(hotels_df))]

airports_df['address_id']= [random.choice(airports_address_list) for i in range(len(airports_df))]

customer_df['address_id']= [random.choice(customer_address_list) for i in range(len(customer_df))]

car_reservation_df['pick_up_location'] = [random.choice(car_address_list) for i in range(car_res_num)]
car_reservation_df['drop_location'] = [random.choice(car_address_list) for i in range(car_res_num)]

# Create Connection to PostgreSQL

In [67]:
from sqlalchemy import create_engine

In [68]:
# Pass the connection string to a variable, conn_url
conn_url = 'postgresql://postgres:1234@localhost/5310_group'

# Create an engine that connects to PostgreSQL server
engine = create_engine(conn_url)

# Establish a connection
connection = engine.connect()

# Create Tables in PostgreSQL

# Import data into PostgreSQL

In [69]:
customer_df = customer_df.reindex(columns=['customer_id', 'first_name', 'last_name', 'email',  'address_id',
                                           'royalty_points','royalty_level'])

hotel_rooms_df = hotel_rooms_df.reindex(columns = ['hotel_id', 'room_number', 'room_type_name', 'room_type_price', 
                                                   'room_type_occupancy','room_type_breakfast', 'room_type_cancellation'])

hotel_reservation_df = hotel_reservation_df.reindex(columns = ['reservation_id', 'hotel_id', 'room_number', 
                                                               'arrival_date', 'departure_date', 'car_parking_needed',
                                                               'price'])

flight_routes_df = flight_routes_df.reindex(columns = ['flight_route_id', 'origin', 'destination', 'stop', 'airline_id', 'airplane_id'])

car_reservation_df = car_reservation_df.reindex(columns = ['reservation_id', 'plate_number', 'pick_up_date', 'pick_up_location',
                                                           'drop_date', 'drop_location','price'])

In [71]:
#membership_status
membership_status_df.to_sql(name='membership_status', con=engine, if_exists='append', index=False)

#address
address_df.to_sql(name='address', con=engine, if_exists='append', index=False)

#customers 
customer_df.to_sql(name='customers', con=engine, if_exists='append', index=False)

#order_tracker
order_tracker_df.to_sql(name='order_tracker', con=engine, if_exists='append', index=False)

#reservation_tracker
reservation_tracker_df.to_sql(name='reservation_tracker', con=engine, if_exists='append', index=False)


##Hotel Tables
#hotels
hotels_df.to_sql(name='hotels', con=engine, if_exists='append', index=False)
#hotel_rooms
hotel_rooms_df.to_sql(name='hotel_rooms', con=engine, if_exists='append', index=False)
#hotel_reservations
hotel_reservation_df.to_sql(name='hotel_reservations', con=engine, if_exists='append', index=False)


#Flights Tables

#airports
airports_df.to_sql(name='airports', con=engine, if_exists='append', index=False)
#airlines
airlines_df.to_sql(name='airline', con=engine, if_exists='append', index=False)
#airplanes
airplane_df.to_sql(name='airplanes', con=engine, if_exists='append', index=False)
#flight_routes
flight_routes_df.to_sql(name='flight_routes', con=engine, if_exists='append', index=False)
#flight_info
flight_info_df.to_sql(name='flight_info', con=engine, if_exists='append', index=False)
#flight_reservation
flight_reservation_df.to_sql(name='flight_reservation', con=engine, if_exists='append', index=False)



#Car Rental Tables

#cars
car_df.to_sql(name='cars', con=engine, if_exists='append', index=False)
#car_reservations
car_reservation_df.to_sql(name='car_reservations', con=engine, if_exists='append', index=False)

673